public class Main {
    public static void main(String[] args) {
    }
}
/*
Сделал как смог, я думал проблемы во мне, я обращался к сокурсникам, так вот что меня удивило, у людей принимали работы,
которые к примеру не сохраняют таски из Json'а и прочее, тесты какие-то подогнанные под значения, короче, я думал
попросить о помощи, а оказалось, что если тестить запросы в их системах через постман/инсомнию они просто не отрабатывают,
и встал в тупике, что все варианты обработать нужно и непонятно как, ситуация, конечно, вау.
В целом, вроде справился, но всё ещё под вопросом, потому что чутка именно базовую логику я бы переписал,
чтоб получилось прям нормальное приложение с сервером.
*/

